In [3]:
import pandas as pd

In [7]:
df = pd.read_csv("2024-2025-data.csv")
print(df.shape)
df.head()

(118, 67)

,Department,7/1/2024,7/8/2024,7/15/2024,7/22/2024,7/29/2024,8/5/2024,8/12/2024,8/19/2024,8/26/2024,...,8/25/2025,9/1/2025,9/8/2025,9/15/2025,9/22/2025,9/29/2025,10/6/2025,10/13/2025,10/20/2025,10/27/2025
0,Accountancy,25,22,17,17,18,12,4,6,45,...,53,173,217,259,266,231,218,236,249,200
1,Advertising,4,1,4,2,2,0,3,2,36,...,41,148,172,229,304,278,290,320,270,282
2,Aerospace Engineering,12,13,7,10,5,5,5,7,59,...,103,133,120,146,180,193,183,186,116,104
3,African American Studies,1,0,0,0,0,0,0,1,2,...,0,0,1,1,2,0,0,1,3,3
4,Ag Ldrshp Educ Comm Program,1,1,3,1,1,1,1,1,4,...,7,4,3,12,5,7,7,9,3,6

In [20]:
print(df["Department"].unique().size)
df["sum"] = df.sum(axis = 1, numeric_only = True) 
df_sum = df[["Department", "sum"]]
df_sum

118

                        Department    sum
0                      Accountancy  39145
1                      Advertising  41245
2            Aerospace Engineering  22070
3         African American Studies    300
4      Ag Ldrshp Educ Comm Program   2245
..                             ...    ...
113  Translation & Interpreting St     15
114       Undergraduate Admissions    300
115      Urban & Regional Planning   6595
116          Vet Clinical Medicine     10
117    Vet Medicine Administration    440

[118 rows x 2 columns]